console.log("Hello world!");
/*
Number - числовой тип данных
2
-678
6.98
Операторы для работы с числами 

Бинарные операторы:
+
-
*
/
() - группировка
% - остаток от деления
** - возведение в степень

Унарные операторы:
+
-

String - строковый тип данных
"Это - строка"
'Это - тоже строка'
`Это - волшебная строка`
"" - пустая строка
" " - это не пустая строка 
*/
console.log(8 ** (1 / 3));
let name;
let word = "вата"; //объявление переменной и задание значения в одном выражении

name = "Vasya"; //завершенное действие - инструкция, она кончается точкой с запятой
word = "каша";
console.log("Это - " + name + "-на " + word);
console.log(`Это - ${name}-на ${word}`);
/*
    Boolean - логический тип данных
    true - 1
    false - 0
    Операторы сравнения
    >   - больше
    >=
    <   - меньше
    <=
    ==  - сравнение на равенство 
    !=  - сравнение на неравенство 
    === - строгое сравнение (сначала проверить тип данных, а затем значение)
    !== - строгое неравенство 
*/
console.log("22" === 22)
//console.log("2" + 2 ==22);
